other_commentary1 =
  'ヒアドキュメントでは<<に続けて文字列の終端を示す識別子を指定します。
今回はその識別子にFLUITESが指定されています。
よって"apple\norange\nbanana\n"と表示されます'

other_commentary2 =
  'ヒアドキュメントでは<<に続けて文字列の終端を示す識別子を指定します。
今回はその識別子にFLUITESが指定されています。
但しヒアドキュメントには終端を示す識別子の前にはスペースなどの文字を記述してはいけないルールがあります。
よって今回は例外が発生します。'

other_commentary3 =
  'ヒアドキュメントでは<<に続けて文字列の終端を示す識別子を指定します。
今回はその識別子にFLUITESが指定されています。
ヒアドキュメントには終端を示す識別子の前にはスペースなどの文字を記述してはいけないルールがありますが識別子の前に「-」を付けることで回避することが出来ます。
よってここでは"apple\norange\nbanana\n"と表示されます。'

other_commentary4 =
  'ヒアドキュメントでは<<に続けて文字列の終端を示す識別子を指定します。
今回はその識別子にFLUITESが指定されています。
ヒアドキュメントでは識別子をダブルクォートとで囲むことで色展開が可能です。
よってここでは"apple\norange\nbanana\n"と表示されます。'

other_commentary5 =
  'ヒアドキュメントでは<<に続けて文字列の終端を示す識別子を指定します。
今回はその識別子にFLUITESが指定されています。
ヒアドキュメントでは識別子をダブルクォートとで囲むことで色展開が可能ですが終端の識別子は囲んではいけないことに注意して下さい。
よってここでは例外が発生します。'





